cask_args appdir: '/Applications'

tap 'homebrew/bundle'

# Ruby env
brew 'chruby'
brew 'ruby-install'

# pyenv
brew 'pyenv'
brew 'pipx'

# Editor
cask 'boostnote'

# screenshot app
cask 'flameshot'

# Interactive SSH
brew 'mosh'

# Podcasts
# https://www.musicpd.org/clients/
cask 'cantata'
brew 'mpd'

# Search utlities
brew 'the_silver_searcher'
brew 'ack'
brew 'fzf'
brew 'ripgrep'
brew 'fd'

brew 'ssh-copy-id'
brew 'coreutils'
brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'jq'
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'wget'
brew 'youtube-dl'
brew 'autoenv'
brew 'tmux'
brew 'stow'

cask 'postman'
cask 'insomnia'
cask 'atom'
cask 'firefox'
cask 'firefox-developer-edition'
cask 'google-chrome'
cask 'handbrake' # video formatter
#cask 'seashore' # Image editing software
cask 'slack'
cask 'vlc'
cask 'flux'
#cask 'rescuetime'

#cask 'evernote' # install and update using UI
#cask 'notion' # install and update using UI
cask 'dropbox'
cask 'google-backup-and-sync'
cask 'imageoptim'
cask 'dbeaver-community'
#cask 'virtualbox' # we'll use the docker and K8
cask 'meld'
#cask 'keepassxc' #Lib issue
cask 'imagealpha'

# Fonts
#cask 'font-iosevka'
#cask 'font-iosevka-slab'

# Taskwarrior
brew 'youtube-dl'
brew 'handbrake'
brew 'imageoptim-cli'
brew 'par'

# Image + PDF compression utils
brew 'ImageMagick'
brew 'googler'
brew 'newsboat'

# rename 's/ /_/g' *
brew 'rename'

# syncthing - To sync the data
#brew 'watson' # use the Toggletrack to track the time, has mobile app

# Use bukubrow-host to manage the bookmarks thru browser
brew 'buku'

brew 'git-crypt'
brew 'gpg2'

# Taskwarrior
brew 'task'
brew 'taskd'
#brew 'tasks' # Not available
brew 'tasksh'
brew 'timewarrior'

brew 'pass' # Password manager
brew 'openssl'
brew 'readline'
brew 'sqlite3'
brew 'xz'
brew 'zlib'

# Framework for language learning
brew 'exercism'
brew 's3cmd'

# containers
brew 'kubectl'
brew 'helm'
cask 'docker'

# Build tool
brew 'bazelisk'
